Repository: Vince14Genius/IPA-Keyboard-iOS
Catalog: IPA Keyboard/Localization/*.lproj/Localizable.strings
Languages: eo, ja, zh_hans, zh_hant

# localized-ipa-wikipedia-url
source: https://en.wikipedia.org/wiki/International_Phonetic_Alphabet
eo: https://eo.wikipedia.org/wiki/Internacia_Fonetika_Alfabeto
ja: https://ja.wikipedia.org/wiki/%E5%9B%BD%E9%9A%9B%E9%9F%B3%E5%A3%B0%E8%A8%98%E5%8F%B7
zh_hans: https://baike.baidu.com/item/%E5%9B%BD%E9%99%85%E9%9F%B3%E6%A0%87
zh_hant: https://zh.wikipedia.org/wiki/%E5%9C%8B%E9%9A%9B%E9%9F%B3%E6%A8%99

# alert-dismiss
source: Got it!
eo: Bone.
ja: OK
zh_hans: OK
zh_hant: OK

# ipakeyboard.title
source: IPA Keyboard
eo: IFA Klavaro
ja: IPAキーボード
zh_hans: IPA音标键盘
zh_hant: IPA音標鍵盤

# localized-title-getting-started
source: Getting Started
eo: Por komenci
ja: はじめに
zh_hans: 开始使用
zh_hant: 開始使用

# localized-title-support-us
source: Support Us
eo: Subteni Nin
ja: 開発者を支援
zh_hans: 支持我们
zh_hant: 支持我們

# localized-title-settings
source: Settings
eo: Agordoj
ja: 設定
zh_hans: 设置
zh_hant: 設定

# localized-title-support-us-exclamation
source: Support Us!
eo: Subteni Nin!
ja: ご支援いただけると幸いです！
zh_hans: 支持我们
zh_hant: 支持我們

# about.ipa.title
source: About IPA
eo: Pri IFA
ja: IPAとは
zh_hans: 关于IPA
zh_hant: 關於IPA

# getting-started-description
source: To set up the keyboard:
eo: Por komenci uzi la klavaron:
ja: このキーボードを追加するには：
zh_hans: 设置键盘步骤：
zh_hant: 設置鍵盤步驟：

# getting-started-1
source: Open the Settings app
eo: Malfermu la programeton "Agordoj"
ja: 「設定」アプリを開けて、
zh_hans: 打开“设置”App
zh_hant: 啟動「設定」App

# getting-started-2
source: Go to General > Keyboard > Keyboards
eo: Iru al Ĝeneralaj > Klavaro > Klavaroj
ja: 「一般」＞「キーボード」＞「キーボード」＞「新しいキーボードを追加...」と選択し、
zh_hans: 前往 “通用” > “键盘” > “键盘”
zh_hant: 前往「一般」＞「鍵盤」＞「鍵盤」

# getting-started-3
source: Tap on "Add New Keyboard..."
eo: Premu "Aldoni novan klavaron..."
ja: 「他社製キーボード」のリストから「IPAキーボード」を選んでください
zh_hans: 点击“添加键盘...”
zh_hant: 點一下「新增鍵盤」

# getting-started-4
source: Add "IPA Keyboard" from the "Third-Party Keyboards" list
eo: Aldonu "IFA Klavaro" el la listo "Tria-Partiaj Klavaroj"
ja: IPAキーボードを使い始めましょう！
zh_hans: 从“第三方键盘”列表添加“IPA键盘”
zh_hant: 從「第三方鍵盤」列表加入「IPA鍵盤」

# getting-started-settings-button
source: Open Settings...
eo: Malfermi "Agordoj"...
ja: 「設定」アプリを開ける...
zh_hans: 打开“设置”App...
zh_hant: 啟動「設定」App...

# getting-started-note
source: If the option does not show up on the list, try restarting your device, or delete the app and reinstall it.
eo: Se la IFA Klavaro ne estas en la listo, provu rekomenci vian aparaton.
ja: リストに「IPAキーボード」がない場合は、アプリを削除して再インストールし、またはデバイスを再起動してみてください。
zh_hans: 如果列表中没有出现此选项，请尝试重启设备，或者重新安装此App。
zh_hant: 如果列表中沒有出現此選項，請嘗試重新啟動設備，或者重新安裝此App。

# keyboardtest.textfield.placeholder
source: You can try the keyboard here after setup.
eo: Vi povas provi ĉi tie post aldoni.
ja: 追加した後はこちらでお試しいただけます
zh_hans: 设置完毕后可在此文本框内尝试使用
zh_hant: 設置完畢後可以在這裡嘗試使用

source: The globe key / switch keyboards key doesn't show up! What do I do???
ja: キーボードを切り替えるボタンが消えた場合
zh_hans: 输入法切换按钮消失的场合
zh_hant: 輸入法切換按鈕消失的場合

source: There used to be a bug where on certain devices the globe key disappears for no reason. We made a fix already, but if the problem still occurs, follow these steps:
ja: 過去、あるデバイスの機種ではキーボードを切り替えるボタンが消えてしまう不具合がございましたが、それは既に直されたはずです。 もしその不具合がまた現れてしまう場合がございましたら、下記の手順に従ってください：
zh_hans: 之前存在输入法切换按钮消失的bug不过现在应该已经修复。 如果这个bug仍然出现，那可以通过以下步骤强制显示切换按钮：
zh_hant: 之前存在輸入法切換按鈕消失的bug不過現在已經修復。 如果這個bug仍然出現，那可以通過以下步驟強制顯示切換按鈕：

source: Go to the Settings tab in this app
ja: このアプリの「設定」タブを開けて、
zh_hans: 打开本App内的设置
zh_hant: 打開本App内的設置

source: Turn on "Force show input switch key"
ja: 「キーボードを切り替えるボタンを強制的に表示」をオンにしてください
zh_hans: 开启“强制显示输入法切换按钮”
zh_hant: 開啟「強制顯示輸入法切換按鈕」

source: Some of the characters are showing up as weird boxes!
ja: 一部の文字が変なはてな付きの四角形になってるんですけど！
zh_hans: 键盘上的某些字符会显示成乱码！

source: This keyboard types Unicode characters of the IPA symbols. It's just that (your version of) iOS doesn't support rendering some of the characters yet. The characters you type out will show up correctly on systems that support rendering them.
ja: お使いのバージョンのiOSの内蔵しているフォントにこの文字が含まれていないのが原因です。 本キーボードは国際音声記号を公式Unicode文字として入力する仕組みになっておりますので、入力された文字は実装されているデバイスでさえあれば正しく表示されます。ご安心ください。
zh_hans: 这只是因为（您正使用的）iOS 版本还没有字体支持显示这些字符。 由于你所输入的IPA符号会作为标准Unicode字符输出，这些字符将在支持显示的系统中正确显示。
zh_hant: This keyboard types Unicode characters of the IPA symbols. It's just that (your version of) iOS doesn't support rendering some of the characters yet. The characters you type out will show up correctly on systems that support rendering them. (這部分懶得翻譯了，以後再說吧)

source: The keyboard doesn't show up in the list, even after I tried reinstalling and restarting!
ja: 再インストール・再起動してもキーボードがリストに現れない場合
zh_hans: 即使重新安装/重启设备，“第三方键盘”列表中依然找不到本输入法的场合
zh_hant: 即使重新安裝/重新啟動設備，「第三方鍵盤」列表內依然找不到本輸入法的場合

source: Sometimes (in very rare cases) this does happen with third-party keyboards on iOS. Unfortunately there's nothing we could do about it.
ja: これはiOSの他社製キーボードがたまに遭う、オペレーティングシステム自身の不具合でございます。 残念ですが我々開発者側からは解決策を提供できませんので申し訳ございません。
zh_hans: 有时在iOS上安装第三方输入法时确实会遇到这种情况（很罕见），这是系统方面的问题。 很抱歉作为开发者我们对此无能为力。
zh_hant: 有時在iOS上安裝第三方輸入法時確實會遇到這種情況（很罕見），這是系統方面的問題。 很抱歉作為開發者我們對此無能為力。

# support-us-donate-title
source: Donate to the developer
eo: Donaci al la programisto
ja: 開発者に寄贈
zh_hans: 向开发者捐赠
zh_hant: 向開發者捐贈

# support-us-donate-subtitle
source: Contribute to our effort to keep this IPA keyboard completely free!
ja: このIPAキーボードはこれからも皆様に無料で提供し続けますので、寄贈していただけると大変助かります。
zh_hans: 本IPA键盘坚持向大家免费提供，欢迎支持免费软件的各位捐款资助！
zh_hant: 本IPA鍵盤堅持向大家免費提供，歡迎支持免費軟體的各位捐款資助！

# support-us-donate-buy-drink
source: 🥤 Buy me a drink
eo: 🥤 Aĉeti trinkaĵon por mi
ja: 🧋 飲み物をおごってあげる
zh_hans: 🧋 帮我买杯饮料
zh_hant: 🧋 幫我買杯飲料

# support-us-donate-buy-meal
source: 🥙 Buy me a meal
eo: 🥙 Aĉeti manĝon por mi
ja: 🍱 食事代をおごってあげる
zh_hans: 🍜 给开发者投食
zh_hant: 🍜 給開發者投食

# support-us-donate-total-count: %lld
source: Thank you for donating %lld times!
eo: Koran dankon por donaci %lld fojojn!
ja: %lld回ご寄贈いただき、誠にありがとうございました！
zh_hans: 非常感谢捐赠%lld次！
zh_hant: 非常感謝捐贈%lld次！

# support-us-rate-title
source: Rate the app if you haven't
ja: 評価もお願い致します
zh_hans: 求评价！欢迎任何好评、意见、以及建议
zh_hant: 歡迎評價！歡迎任何好評、意見、以及建議

# support-us-rate-button
source: Rate us on the App Store
ja: App Storeで評価
zh_hans: 在 App Store 评价我们
zh_hant: 在 App Store 評價我們

# support-us-share-title
source: Spread the word on social media
eo: Bonvolu diskonigi tiun ĉi programeton en sociaj retejoj
ja: このアプリ #拡散希望
zh_hans: 让有需要的朋友也知道这个IPA键盘吧
zh_hant: 讓有需要的朋友也知道這個IPA鍵盤吧

# support-us-share-button
source: Copy share link
eo: Kopii la retadreson por diskonigi
ja: 共有リンクをコピー
zh_hans: 复制分享链接
zh_hant: 複製分享連結

# link-copied-banner
source: Link Copied!
eo: Kopiis la retadreson!
ja: コピー済み
zh_hans: 链接已复制！
zh_hant: 連結已複製！

# support-us-friends-apps-title
source: Check out our friends' apps
eo: Provu la programetojn de niaj amikoj
ja: 友人たちのアプリも試してご覧
zh_hans: 友情App链接
zh_hant: 友情App連結

# support-us-friends-apps-tbd
source: TBD
eo: Venos baldaŭ
ja: 近日公開
zh_hans: 敬请期待
zh_hant: 敬請期待

# localized-title-keyboards
source: Keyboards
eo: Klavaroj
ja: キーボードリスト
zh_hans: 键盘列表
zh_hant: 鍵盤列表

# localized-keyboard-ipa
source: IPA (Standard, 2018)
eo: IFA (IPA, Standard, 2020)
ja: IPA (公式, 2020)
zh_hans: IPA（官方，2020）
zh_hant: IPA（標準，2020）

# localized-keyboard-extipa
source: extIPA (Standard, 2016)
eo: extIFA (extIPA, Standard, 2016)
ja: extIPA (公式, 2016)
zh_hans: extIPA（官方，2016）
zh_hant: extIPA（標準，2016）

# localized-keyboard-nonstandard-obsolete
source: Nonstandard/Obsolete Symbols
eo: Malvalidaj/Malaktualaj Simboloj
ja: 非公式・破棄された記号
zh_hans: 非官方/已废弃字符（包括舌尖元音）
zh_hant: 非正規/已廢棄字元

# localized-keyboard-custom
source: Custom IPA Keyboard
eo: Laŭmenda IFA Klavaro
ja: カスタムIPAキーボード
zh_hans: 自定义IPA键盘
zh_hant: 自定義IPA鍵盤

# localized-link-customize
source: Customize...
eo: Agordi...
ja: カスタマイズ...
zh_hans: 自定义...
zh_hant: 自定義...

# localized-keyboard-recents
source: Recently used keys
eo: Klavojn vi uzis lastatempe
ja: よく使う記号
zh_hans: 最近使用的字符
zh_hant: 最近使用的字元

# localized-unlock-nonstandard-obsolete
source: Unlock Nonstandard/Obsolete Symbols
eo: Malŝlosi Malvalidajn/Malaktualajn Simbolojn
ja: 非公式・破棄された記号をアンロック
zh_hans: 解锁非官方/已废弃字符（包括舌尖元音）
zh_hant: 解鎖非正規/已廢棄字元

# localized-unlock-custom
source: Unlock Custom IPA Keyboard
eo: Malŝlosi Custom IPA Keyboard
ja: カスタムIPAキーボードをアンロック
zh_hans: 解锁自定义IPA键盘
zh_hant: 解鎖自定義IPA鍵盤

# alert-coming-soon
source: Coming Soon
eo: Venos baldaŭ
ja: 近日発売
zh_hans: 敬请期待
zh_hant: 敬請期待

# button-restore-purchases
source: Restore Purchases
eo: Restarigi aĉetojn
ja: 購入履歴復元
zh_hans: 恢复购买记录
zh_hant: 恢復購買記錄

# localized-button-bugreport
source: Bug Report / Feedback
eo: Cimo-Raporti / Retrosciigi
ja: バグ報告・ご意見箱
zh_hans: 问题报告/提供建议
zh_hant: 問題報告/提供建議

source: Advanced Settings
eo: Altgradaj Agordoj
ja: 詳細設定
zh_hans: 高级设置
zh_hant: 高級設定

# settings-movable-cursor
source: Movable Cursor
eo: Butonoj por movi la kursoron
ja: 入力カーソルを移動するボタンを表示
zh_hans: 可移动光标
zh_hant: 可移動游標

source: Force show input switch key (globe key)
eo: Perforte montri la butonon por ŝanĝi klavarojn
ja: キーボードを切り替えるボタンを強制的に表示
zh_hans: 强制显示输入法切换按钮
zh_hant: 強制顯示輸入法切換按鈕
