Repository: Vince14Genius/IPA-Keyboard-iOS
Catalog: IPA Keyboard Extension/*.lproj/Localizable.strings
Languages: eo, ja

# SpaceBarText
source: space
eo: spaceto
ja: 空白

source: Standard
ja: IPA(公式)

source: IPA (Standard)
eo: IFA (Standard)
ja: IPA (公式)

source: Extended IPA
eo: extIFA (Aldonoj al la IFA)
ja: extIPA（拡張IPA）

source: Nonstandard
ja: 非公式記号

source: Nonstandard & Obsolete Symbols
eo: Nonstandard (Malvalidaj/Malaktualaj Simboloj)
ja: 非公式・破棄された記号

source: NumPad
eo: Numeroj
ja: 数字入力

source: Number Pad
eo: Klavaro de Numeroj
ja: 数字入力

source: Consonants
eo: Konsonantoj
ja: 子音

source: Non-Pulmonic
eo: Ne-Pulmona
ja: 子音（非肺臓気流）

source: Other Symbols
eo: Altaj Simboloj
ja: その他の記号

source: Vowels
eo: Vokaloj
ja: 母音

source: Suprasegmentals
eo: Supersegmentaĵoj
ja: 超分節要素

source: Tones and Word Accents
eo: Tonoj kaj akcentoj
ja: 声調記号とアクセント

source: Diacritics
eo: Diakritiloj
ja: 補助記号

source: Voicing
ja: 清音・濁音

source: Other Sounds
ja: その他の音

source: Consonant Superscripts
ja: 子音の上付き

source: Vowel Superscripts
ja: 母音の上付き

source: Ligatures
ja: 合字

source: Numerals
ja: 数字記号

source: Small Caps & Uppercase
ja: 小型英大文字・IPA大文字

source: Sinologist & Koreanist
ja: SinologistとKoreanist

source: Americanist & Slavicist
ja: AmericanistとSlavicist

source: Obsolete
ja: 破棄された記号

source: Community Requested
ja: コミュニティ要望

source: extIPA
eo: extIFA
